# Пользователь вводит с клавиатуры размер стороны 
# квадрата. Требуется отобразить на экран заполненный 
# квадрат. Размер стороны равен введённому размеру. 
# Например, если пользователь ввёл 3 на экране будет 
# выведено:
#  ***
#  ***
#  ***

# repeats = int(input("введите размер стороны квадрата: "))

# for row in range(repeats):
#     for col in range(repeats):
#         print('*', end=' ')
#     print()

# Пользователь вводит с клавиатуры ширину и вы
# соту прямоугольника. Требуется отобразить на экран 
# заполненный прямоугольник с указанными высотой и 
# шириной. Например, если пользователь ввёл высоту 3, 
# а ширину 5 на экране будет выведено:
#  *****
#  *****
#  *****

# h = int(input("введите высоту прямоугольника: "))
# l = int(input("введите ширина прямоугольника:"))

# for row in range(h):
#     for col in range(l):
#         print('*', end=' ')
#     print()


# Пользователь вводит с клавиатуры размер стороны 
# квадрата. Требуется отобразить на экран незаполнен
# ный квадрат (отображаются только границы квадрата). 
# Размер стороны равен введённому размеру.

